import { createApp } from 'vue'

createApp({}).mount('#app')

// Задача 1:
// Добавьте два компонента в приложение:
// // Активный пользовательский компонент и компонент пользовательских данных
// // Активный пользователь должен ввести имя пользователя (h2) и возраст (h3)
// // Данные пользователя должны выводиться в двух полях ввода => для имени и возраста
// Необязательно: добавьте стиль по вашему выбору

// Задача 2: Выведите оба компонента бок о бок в вашем основном шаблоне приложения

// Задача 3: Добавьте данные пользователя и убедитесь, что они содержат имя и возраст
// // Пользовательские данные должны выводиться неактивным пользователем
// // Он должен быть обновлен с помощью компонента пользовательских данных